Repository: tinker-tom/CleanArchitectureWithBlazorServer
Catalog: src/Infrastructure/Resources/Services/SecurityAnalysisService.*.resx
Languages: de_de, zh_cn

# AccountBruteForceFactor
source: Account brute force detected: {0} failed login attempts within {1} minutes
de_de: Brute-Force-Angriff auf Konto erkannt: {0} fehlgeschlagene Anmeldeversuche innerhalb von {1} Minuten
zh_cn: 检测到账户暴力破解：在 {1} 分钟内有 {0} 次登录失败

# IpBruteForceFactor
source: IP-based brute force detected: {0} failed attempts from IP {1} targeting {2} different accounts
de_de: IP-basierter Brute-Force-Angriff erkannt: {0} fehlgeschlagene Versuche von IP {1} gegen {2} verschiedene Konten
zh_cn: 检测到基于 IP 的暴力破解：来自 IP {1} 的 {0} 次失败尝试，目标为 {2} 个不同账户

# NewIpFactor
source: new IP address ({0})
de_de: neue IP-Adresse ({0})
zh_cn: 新的 IP 地址（{0}）

# NewRegionFactor
source: new geographic location ({0})
de_de: neuer geografischer Standort ({0})
zh_cn: 新的地理位置（{0}）

# NewBrowserFactor
source: new device/browser ({0})
de_de: neues Gerät/Browser ({0})
zh_cn: 新的设备/浏览器（{0}）

# LoginFromFactors
source: Login from {0}
de_de: Anmeldung von {0}
zh_cn: 来自 {0} 的登录

# UnusualHoursFactor
source: Login during unusual hours ({0} UTC)
de_de: Anmeldung zu ungewöhnlichen Zeiten ({0} UTC)
zh_cn: 在非常规时间登录（UTC {0}）

# Advice_Critical_ImmediateAction
source: IMMEDIATE ACTION REQUIRED: Secure your account immediately
de_de: SOFORTIGES HANDELN ERFORDERLICH: Sichern Sie Ihr Konto umgehend
zh_cn: 需要立即处理：请立即保护您的账户

# Advice_Critical_ChangePassword
source: Change your password right now
de_de: Ändern Sie Ihr Passwort sofort
zh_cn: 请立即修改密码

# Advice_Critical_Enable2FA
source: Enable two-factor authentication immediately
de_de: Aktivieren Sie umgehend die Zwei-Faktor-Authentifizierung
zh_cn: 立即启用双重验证

# Advice_Critical_ReviewDevices
source: Review and revoke access for all devices
de_de: Überprüfen Sie alle Geräte und entziehen Sie den Zugriff
zh_cn: 检查并撤销所有设备的访问权限

# Advice_Critical_ContactSecurity
source: Contact security team if this activity was not authorized
de_de: Kontaktieren Sie das Sicherheitsteam, wenn diese Aktivität nicht autorisiert war
zh_cn: 若此活动并非您本人操作，请联系安全团队

# Advice_High_ReviewActivity
source: Immediately review recent account activity
de_de: Überprüfen Sie sofort die jüngsten Kontoaktivitäten
zh_cn: 立即检查最近的账户活动

# Advice_High_ChangePasswordConsider
source: Consider changing your password
de_de: Erwägen Sie, Ihr Passwort zu ändern
zh_cn: 建议修改密码

# Advice_High_Enable2FA
source: Enable two-factor authentication if not already active
de_de: Aktivieren Sie die Zwei-Faktor-Authentifizierung, falls noch nicht aktiv
zh_cn: 如果尚未启用，请开启双重验证

# Advice_High_MonitorAccount
source: Monitor your account closely for the next few days
de_de: Überwachen Sie Ihr Konto in den nächsten Tagen genau
zh_cn: 未来几天请密切关注您的账户

# Advice_Medium_Monitor
source: Monitor your account for unusual activity
de_de: Überwachen Sie Ihr Konto auf ungewöhnliche Aktivitäten
zh_cn: 关注账户是否存在异常活动

# Advice_Medium_Enable2FAConsider
source: Consider enabling two-factor authentication
de_de: Erwägen Sie die Aktivierung der Zwei-Faktor-Authentifizierung
zh_cn: 建议开启双重验证

# Advice_Medium_ReviewLoginHistory
source: Review your recent login history
de_de: Überprüfen Sie Ihre jüngste Anmeldehistorie
zh_cn: 查看您最近的登录记录

# Advice_Low_Normal
source: Your account security appears normal
de_de: Die Sicherheit Ihres Kontos scheint normal zu sein
zh_cn: 您的账户安全状况正常

# Advice_Factor_BruteForce_ChangePassword
source: Change your password immediately - brute force attack detected
de_de: Ändern Sie Ihr Passwort sofort – Brute-Force-Angriff erkannt
zh_cn: 检测到暴力破解，请立即修改密码

# Advice_Factor_BruteForce_ReviewDevices
source: Review and revoke access for any unrecognized devices
de_de: Überprüfen Sie nicht erkannte Geräte und entziehen Sie deren Zugriff
zh_cn: 检查并撤销所有未知设备的访问权限

# Advice_Factor_BruteForce_StrongerPassword
source: Consider using a more complex password or passphrase
de_de: Verwenden Sie ein stärkeres Passwort oder eine Passphrase
zh_cn: 建议使用更复杂的密码或口令

# Advice_Factor_NewLocation_Verify
source: Verify this login was made by you from the new location
de_de: Bestätigen Sie, dass die Anmeldung von dem neuen Standort durch Sie erfolgt ist
zh_cn: 请确认该登录来自您的新位置

# Advice_Factor_NewLocation_SecureIfUnrecognized
source: If unrecognized, secure your account and change credentials immediately
de_de: Falls unbekannt, sichern Sie Ihr Konto und ändern Sie umgehend die Zugangsdaten
zh_cn: 如非本人，请立即保护账户并更改凭据

# Advice_Factor_NewDevice_Verify
source: Verify this login was made from your device
de_de: Bestätigen Sie, dass die Anmeldung von Ihrem Gerät aus erfolgte
zh_cn: 请确认该登录来自您的设备

# Advice_Factor_NewDevice_PublicDevice
source: If using a public or shared device, ensure you log out completely
de_de: Bei öffentlichen/Shared-Geräten melden Sie sich vollständig ab
zh_cn: 若为公共/共享设备，请确保完全登出

# Advice_Factor_UnusualHours_Secure
source: If this wasn't you logging in during unusual hours, secure your account immediately
de_de: Wenn Sie sich nicht zu ungewöhnlichen Zeiten angemeldet haben, sichern Sie Ihr Konto umgehend
zh_cn: 如非本人在非常规时间登录，请立即保护账户
